ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC14_UART_1.0.xml
    <register id="UC14_UART_LINCTL" width="32" offset="0x1134" description="UART LIN Mode Control Register">
        <bitfield id="CTRENA" description="LIN Counter Enable. LIN counter will only count when enabled." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Counter enabled"/>
        </bitfield>
        <bitfield id="ZERONE" description="Zero on negative Edge of RXD. When enabled the counter is set to 0 and starts counting on a negative edge of RXD" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Zero on negative edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Zero on negative edge enabled"/>
        </bitfield>
        <bitfield id="CNTRXLOW" description="Count while low Signal on RXD When counter is enabled and the signal on RXD is low, the counter increments." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Count while low Signal on UARTxRXD disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Count while low Signal on UARTxRXD enabled"/>
        </bitfield>
        <bitfield id="LINC0CAP" description="Capture Counter on negative RXD Edge. When enabled the counter value is captured to LINC0 register on each negative RXD edge. A LINC0 interrupt is triggered when enabled." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on negative UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on negative UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC1CAP" description="Capture Counter on positive RXD Edge. When enabled the counter value is captured to LINC1 register on each positive RXD edge. A LINC1 interrupt is triggered when enabled." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on positive UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on positive UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC0_MATCH" description="Counter Compare Match Mode  When this bit is set to 1 a counter compare match with LINC0 register triggers an LINC0 interrupt when enabled." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter compare match mode disabled (capture mode enabled)"/>
            <bitenum id="ENABLE" value="0x1" description="Counter compare match enabled (capture mode disabled)"/>
        </bitfield>
        <bitfield id="EN_FRM_ERR" description="Enable FRAME ERROR" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Frame Error Generation 
If STOP bit of '0' is received, then, FRAME ERROR is not generated"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Frame Error Generation 
If STOP bit of '0' is received, then, FRAME ERROR is generated"/>
        </bitfield>
    </register>
    <register id="UC14_UART_LINC0" width="32" offset="0x1138" description="UART LIN Mode Capture 0 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD falling edge and can generate a LINC0 interrupt when capture is enabled (LINC0CAP = 1).
If compare mode is enabled (LINC0_MATCH = 1), a counter match can generate a LINC0 interrupt." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC14_UART_LINC1" width="32" offset="0x113C" description="UART LIN Mode Capture 1 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD rising edge and can generate a LINC1 interrupt when capture is enabled (LINC1CAP = 1)" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC14_UART_AMASK" width="32" offset="0x1148" description="Self Address Mask Register">
        <bitfield id="MSK" description="Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register must match." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC14_UART_ADDR" width="32" offset="0x114C" description="Self Address Register">
        <bitfield id="ADDR" description="Self Address for 9-Bit Mode  This field contains the address that should be matched when UARTxAMASK is FFh." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>

</module>